// TEST ZONE
let cardsArray = [
  {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: true,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: true,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: true,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.unsplash.com/photo-1503023345310-bd7c1de61c7d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8aHVtYW58ZW58MHx8MHw%3D&ixlib=rb-1.2.1&w=1000&q=80",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://images.ctfassets.net/hrltx12pl8hq/6bi6wKIM5DDM5U1PtGVFcP/1c7fce6de33bb6575548a646ff9b03aa/nature-photography-pictures.jpg?fit=fill&w=800&h=300",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  },
      {
    imageSrc:
      "https://www.w3schools.com/w3css/img_lights.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7M9-YA29sTkMuAzB9sHp9S5dER2QH762gpg&usqp=CAU",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Тут находится заголовок карточки Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает. Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает`,
    source: "Медуза",
    saved: undefined,
  },  {imageSrc:
      "https://iso.500px.com/wp-content/uploads/2014/02/35882320-2048.jpeg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text:
      "Для того что бы вызвать окно без результатов нужно получить пустой массив, то есть удалить данные из cardsArray",
    source: "Медуза",
    saved: undefined,
  },
    {
    imageSrc:
      "https://static.addtoany.com/images/dracaena-cinnabari.jpg",
    imageAlt: "imageAlt",
    keyword: "keyword",
    date: "2 августа, 2019",
    title: "Заголовок карточки",
    text: `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.. Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты`,
    source: "Медуза",
    saved: undefined,
  }
];


export default cardsArray;
//
